socialNetwork/containers1_2000_hej.txt
Running 1m test @ http://localhost:8080/wrk2-api/user/register
  8 threads and 100 connections

  Thread calibration: mean lat.: 0.273ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.277ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.271ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.277ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.275ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.269ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.274ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.273ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/user/register 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   275.31us  109.30us 673.00us   88.27%
    Req/Sec   527.91    237.17     1.20k    69.30%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  245.00us
 75.000%  299.00us
 90.000%  392.00us
 99.000%  673.00us
 99.900%    1.06ms
 99.990%    2.91ms
 99.999%    4.57ms
100.000%    4.91ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.116     0.000000            1         1.00
       0.194     0.100000        20908         1.11
       0.208     0.200000        41025         1.25
       0.220     0.300000        61200         1.43
       0.232     0.400000        81045         1.67
       0.245     0.500000       100431         2.00
       0.253     0.550000       111003         2.22
       0.262     0.600000       121280         2.50
       0.272     0.650000       131048         2.86
       0.284     0.700000       140820         3.33
       0.299     0.750000       150546         4.00
       0.308     0.775000       155393         4.44
       0.319     0.800000       160362         5.00
       0.332     0.825000       165409         5.71
       0.348     0.850000       170466         6.67
       0.368     0.875000       175579         8.00
       0.379     0.887500       178011         8.89
       0.392     0.900000       180507        10.00
       0.407     0.912500       183018        11.43
       0.425     0.925000       185456        13.33
       0.446     0.937500       187896        16.00
       0.459     0.943750       189178        17.78
       0.474     0.950000       190457        20.00
       0.489     0.956250       191657        22.86
       0.507     0.962500       192900        26.67
       0.529     0.968750       194147        32.00
       0.543     0.971875       194809        35.56
       0.557     0.975000       195438        40.00
       0.573     0.978125       196043        45.71
       0.592     0.981250       196681        53.33
       0.615     0.984375       197300        64.00
       0.627     0.985938       197605        71.11
       0.643     0.987500       197912        80.00
       0.660     0.989062       198229        91.43
       0.681     0.990625       198530       106.67
       0.705     0.992188       198844       128.00
       0.717     0.992969       198998       142.22
       0.733     0.993750       199158       160.00
       0.752     0.994531       199314       182.86
       0.776     0.995313       199470       213.33
       0.805     0.996094       199626       256.00
       0.820     0.996484       199703       284.44
       0.838     0.996875       199782       320.00
       0.863     0.997266       199861       365.71
       0.891     0.997656       199941       426.67
       0.917     0.998047       200017       512.00
       0.936     0.998242       200057       568.89
       0.953     0.998437       200094       640.00
       0.980     0.998633       200134       731.43
       1.017     0.998828       200173       853.33
       1.071     0.999023       200212      1024.00
       1.097     0.999121       200231      1137.78
       1.125     0.999219       200252      1280.00
       1.166     0.999316       200271      1462.86
       1.218     0.999414       200290      1706.67
       1.252     0.999512       200310      2048.00
       1.289     0.999561       200319      2275.56
       1.351     0.999609       200329      2560.00
       1.424     0.999658       200339      2925.71
       1.482     0.999707       200349      3413.33
       1.674     0.999756       200359      4096.00
       1.762     0.999780       200363      4551.11
       1.865     0.999805       200368      5120.00
       1.997     0.999829       200373      5851.43
       2.433     0.999854       200378      6826.67
       2.781     0.999878       200383      8192.00
       2.865     0.999890       200385      9102.22
       2.955     0.999902       200388     10240.00
       3.107     0.999915       200390     11702.86
       3.237     0.999927       200393     13653.33
       3.443     0.999939       200395     16384.00
       3.469     0.999945       200396     18204.44
       3.543     0.999951       200398     20480.00
       3.605     0.999957       200399     23405.71
       3.611     0.999963       200400     27306.67
       3.695     0.999969       200401     32768.00
       3.701     0.999973       200402     36408.89
       3.725     0.999976       200403     40960.00
       3.725     0.999979       200403     46811.43
       3.911     0.999982       200404     54613.33
       3.911     0.999985       200404     65536.00
       4.571     0.999986       200405     72817.78
       4.571     0.999988       200405     81920.00
       4.571     0.999989       200405     93622.86
       4.615     0.999991       200406    109226.67
       4.615     0.999992       200406    131072.00
       4.615     0.999993       200406    145635.56
       4.615     0.999994       200406    163840.00
       4.615     0.999995       200406    187245.71
       4.911     0.999995       200407    218453.33
       4.911     1.000000       200407          inf
#[Mean    =        0.275, StdDeviation   =        0.109]
#[Max     =        4.908, Total count    =       200407]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  240269 requests in 1.00m, 45.60MB read
Requests/sec:   4004.31  
Transfer/sec:    778.18KB